package com.ilwit.mytrainingapp

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import com.ilwit.mytrainingapp.databinding.ActivityMainBinding

class MainActivity : AppCompatActivity() {


    lateinit var mAct: ActivityMainBinding

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        mAct = ActivityMainBinding.inflate(layoutInflater)
        setContentView(mAct.root)
        mAct.button1.setOnClickListener {
            goNextAct("Action_movie")

        }
        mAct.button2.setOnClickListener {
            goNextAct("Comedy")
        }
        mAct.button3.setOnClickListener {
            goNextAct("Drama")
        }
        mAct.button4.setOnClickListener {
            goNextAct("Trillers")
        }

    }


    companion object {
        val films = mapOf(
            "Drama" to arrayOf("Если только", "В погоне за счастьем", "7 жизней","Игры разума" , "Общество мертвых поэтов"
                ,"Проект Флорида","Возвращение","Внутри Льюина Дэвиса","Пианист","Паразиты","Пробуждение","Реквием по мечте","Нефть"
                ,"Жизнь прекрасна","Огни рампы","Человек дождя","Древо жизни","Лунный свет","12 разгневанных мужчин",
                "Пролетая над гнездом кукушки","Форест Гамп","Одержимость","Список Шиндлера","Джокер","Побег из Щоушенка",
                "Зеленая миля","1+1","Хатико", "Изгой","Ford против Ferrari","Брат","Идеальные незнакомцы","Зеленая книга","А зори здесь тихие",
                "Титаник","Гладиатор","Достучаться др небес","Адвокат дьявола","Загадочная история Бенджамина Баттона"
                ,"В метре друг от друга","Остров проклятых","По соображениям совести","Собачья жизнь","Миллионер из трущоб","После",
                "Это чертово сердце","Социальная сеть","Эффект бабочки","Ученик чародея","Дом у озера","Тренер Картер"),
            "Comedy" to arrayOf("Евротур", "Американский пирог", "ДМБ","Быстрее пули" , "Славные парни"
                ,"Борат","Мы - Миллеры","Впритык","Всегда говори - ДА","Крутой парень","Убойные каникулы","Дом большой мамочки",
                "Цыпочка","Большой Стэн","Король вечеринок","Она мужчина","Не шутите с Зоханом","Мальчишник в Вегасе","Полицейская академия",
                "Поменяться местами","Лжец, лжец","Реальные упыри","Эйс Вентура","Без чувств","Мужчина по вызову","Черный рыцарь",
                "Мачо и ботан","Несносные боссы","Диктатор","Братья из Гримсби","Маска","Майор Пэйн","Дэдпул","Укрощение строптивого",
                "Пришельцы","Гарольд и Кумар уходят в отрыв","Брюс Всемогущий","Такси","Поездка в Америку"
                ,"Не грози южному централу","Тупой и еще тупее","Zомбилэнд","Крысиные бега","Парни со стволами","Типа крутые легавые",
                "Аферисты: Дик и Джейн","Большой куш","Бриллиантовый полицейский","Особенности национальной охоты","0Нечего терять","Белые не умеют прыгать"),
            "Trillers" to arrayOf("Семь", "Старикам тут не место", "Убийца","Апгрейд" , "Помни"
                ,"Исчезнувшая","Константин","Три дня на побег","Исходный код","Законопослушный гражданин","Начало",
                "Девушка с татуировкой дракона","Остров проклятых","Воздушный маршал","Заложница","Посылка","Машинист","Экзамен",
                "Бойцовский клуб","Пророк","Багровые реки","Инферно","Зодиак","Девушка в поезде","Цена измены","Кловерфилд 10","Немыслимое",
                "Линкольн для адвоката","Куб","Пункт назначения","Молчание ягнят","Сплит","Неуязвимый","Стекло","Адвокат дьявола","Коллектор",
                "Области тьмы","Коматозники","Петля времени","Эффект бабочки","Камень","13","Тайна перевала дятлова","Оно","Прочь","Пленницы",
                "Оружейный барон","Убийства в Оксфорде","Жизнь Дэвида Гейла","Американский психопат","Шестое чувство"),
            "Action_movie" to arrayOf("Крепкий орешек", "Час пик", "13 район","Пьяный мастер" , "Терминатор 2"
                ,"Леон","Васаби","Двойной удар","Кровавый спорт","Доспехи бога","Разборка в Бронксе","Рейд","Джон Уик","Блэйд","Неудержимые",
                "Матрица","Гладиатор","Бумер","Апгрейд","Человек из ниоткуда","Джентельмены","Карты деньги два ствола","Перестрелка","Боец",
                "Стрелок","Бесславные ублюдки","Рэмбо","Рокки","Святые из Бундока","Убойный футбол","Малыш на драйве","Онг Бак","Хроники Риддика",
                "Перевозчик","Кто я?","Королевская битва","Голодные игры","Мистер и миссис Смит","Шанхайский полдень"
                ,"Плохие парни","Я - легенда","300 спартанцев","Хардкор","Патруль","Эквилибриум","Заложница","Великий уравнитель","Книга Илая",
                "Грань будущего","Брат 2","Война","Дурак","Майор","Джанго освобождённый","Криминальное чтиво","7 психопатов","Залечь на дно в Брюгге",
                "Омерзительная восьмерка","Безумный Макс","","","","","","","","","","","","","",""
                ,"","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","")
        )
    }

       fun goNextAct(st: String) {
        val i = Intent(this, ListFilmActivity::class.java)
           i.putExtra(ListFilmActivity.FILMS_KEY, MainActivity.films[st])
           i.putExtra(ListFilmActivity.TITLE_KEY, st )
           startActivity(i)

    }

}